<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Hugo, a fast and modern static website engine written in Golang. Defaults to 64bit version.</string>
	<key>Identifier</key>
	<string>com.github.apettinen.download.Hugo</string>
	<key>Input</key>
	<dict>
		<key>GITHUB_REPO</key>
		<string>spf13/hugo</string>
		<key>NAME</key>
		<string>Hugo</string>
		<key>INCLUDE_PRERELEASES</key>
		<string></string>
		<key>KERNEL_BITS</key>
		<string>64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
				<key>asset_regex</key>
				<string>hugo_[0-9].[0-9]{2}_macOS-%KERNEL_BITS%bit.zip</string>
				<key>include_prereleases</key>
				<string>%INCLUDE_PRERELEASES%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%KERNEL_BITS%bit-%version%.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
