<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of SubEthaEdit editor and extracts the app.</string>
    <key>Identifier</key>
    <string>com.github.apettinen.download.SubEthaEdit</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SubEthaEdit</string>
        <key>URL</key>
        <string>https://subethaedit.net/SubEthaEdit.zip</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
								<string>%URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
				<dict>
					<key>Processor</key>
					<string>Unarchiver</string>
					<key>Arguments</key>
					<dict>
						<key>archive_path</key>
						<string>%pathname%</string>
						<key>purge_destination</key>
						<true/>
						<key>destination_path</key>
						<string>%RECIPE_CACHE_DIR%/unarchived/</string>
					</dict>
				</dict>
				<dict>
						<key>Processor</key>
						<string>CodeSignatureVerifier</string>
						<key>Arguments</key>
						<dict>
							<key>input_path</key>
							<string>%RECIPE_CACHE_DIR%/unarchived/SubEthaEdit.app</string>
							<key>requirement</key>
							<string>anchor apple generic and identifier "de.codingmonkeys.SubEthaEdit.MacFULL" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = S76GCAG929)</string>
						</dict>
					</dict>
    </array>
</dict>
</plist>
