<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of SonarQube Scanner and repackages it.</string>
    <key>Identifier</key>
    <string>com.github.apettinen.pkg.SonarQubeScanner</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>SonarQube_Scanner</string>
			<key>ARCHIVE_NAME</key>
			<string>sonar-scanner</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apettinen.download.SonarQubeScanner</string>
    <key>Process</key>
    <array>
        <dict>
          <key>Processor</key>
          <string>PkgRootCreator</string>
          <key>Arguments</key>
          <dict>
            <key>pkgroot</key>
            <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            <key>pkgdirs</key>
            <dict>
              <key>usr</key>
              <string>0755</string>
              <key>usr/local</key>
              <string>0755</string>
              <key>usr/local/sonarqubescanner</key>
              <string>0755</string>
            </dict>
          </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unarchived</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
				<dict>
					<key>Processor</key>
					<string>FileMover</string>
					<key>Arguments</key>
					<dict>
						<key>source</key>
						<string>%RECIPE_CACHE_DIR%/unarchived/%ARCHIVE_NAME%-%version%-%ARCHITECTURE%</string>
						<key>target</key>
						<string>%pkgroot%/usr/local/sonarqubescanner</string>
					</dict>
				</dict>
        <dict>
          <key>Processor</key>
          <string>PkgCreator</string>
          <key>Arguments</key>
          <dict>
            <key>pkgname</key>
            <string>%NAME%</string>
            <key>pkg_request</key>
            <dict>
              <key>pkgdir</key>
              <string>%RECIPE_CACHE_DIR%</string>
              <key>id</key>
              <string>org.sonarcube.pkg.sonarqubescanner</string>
              <key>options</key>
              <string>purge_ds_store</string>
              <key>version</key>
              <string>%version%</string>
              <key>chown</key>
              <array>
                <dict>
                  <key>path</key>
                  <string>usr</string>
                  <key>user</key>
                  <string>root</string>
                  <key>group</key>
                  <string>admin</string>
                </dict>
              </array>
            </dict>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>PathDeleter</string>
          <key>Comment</key>
          <string>Cleaning up</string>
          <key>Arguments</key>
          <dict>
            <key>path_list</key>
            <string>%pkgroot%</string>
          </dict>
        </dict>
    </array>
</dict>
</plist>
