<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
		<string>Downloads, packages, and adds to Munki the latest version of faas-cli, the CLI for use with OpenFaaS - a serverless functions framework for Docker and Kubernetes. The CLI can be used to build and deploy functions to OpenFaaS. The package will install to /usr/local/bin</string>
    <key>Identifier</key>
    <string>com.github.apettinen.munki.faas-cli</string>
    <key>ParentRecipe</key>
    <string>com.github.apettinen.pkg.faas-cli</string>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_NAME</key>
        <string>%NAME%</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>MUNKI_CATEGORY</key>
        <string>Developer Tools</string>
        <key>MUNKI_DEVELOPER</key>
        <string>The OpenFAAS Project</string>
        <key>DISPLAY_NAME</key>
        <string>%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
						<string>This is a CLI for use with OpenFaaS - a serverless functions framework for Docker and Kubernetes. The CLI can be used to build and deploy functions to OpenFaaS. You can build OpenFaaS functions from a set of supported language templates (such as Node.js, Python, CSharp and Ruby). That means you just write a handler file such as (handler.py/handler.js) and the CLI does the rest to create a Docker image.i</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%MUNKI_NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
