<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
		<string>This is a CLI for use with OpenFaaS - a serverless functions framework for Docker and Kubernetes. The CLI can be used to build and deploy functions to OpenFaaS. The package will install to /usr/local/bin/</string>
    <key>Identifier</key>
    <string>com.github.apettinen.install.faas-cli</string>
    <key>Input</key>
    <dict/>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apettinen.pkg.faas-cli</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
