<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
		<string>Downloads and packages the latest version of faas-cli, the CLI for use with OpenFaaS - a serverless functions framework for Docker and Kubernetes. The CLI can be used to build and deploy functions to OpenFaaS. The package will install to /usr/local/bin</string>
    <key>Identifier</key>
    <string>com.github.apettinen.pkg.faas-cli</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>faas-cli</string>
      <key>BINARY_NAME</key>
      <string>faas-cli</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apettinen.download.faas-cli</string>
    <key>Process</key>
    <array>
        <dict>
          <key>Processor</key>
          <string>PkgRootCreator</string>
          <key>Arguments</key>
          <dict>
            <key>pkgroot</key>
            <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            <key>pkgdirs</key>
            <dict>
              <key>usr</key>
              <string>0755</string>
              <key>usr/local</key>
              <string>0755</string>
              <key>usr/local/bin</key>
              <string>0755</string>
            </dict>
          </dict>
        </dict>
				<dict>
					<key>Processor</key>
          <string>FileMover</string>
          <key>Arguments</key>
          <dict>
            <key>source</key>
            <string>%pathname%</string>
            <key>target</key>
            <string>%pkgroot%/usr/local/bin/%BINARY_NAME%</string>
          </dict>
				</dict>
        <dict>
          <key>Processor</key>
          <string>PkgCreator</string>
          <key>Arguments</key>
          <dict>
            <key>pkg_request</key>
            <dict>
              <key>pkgname</key>
              <string>%NAME%-%version%</string>
              <key>pkgdir</key>
              <string>%RECIPE_CACHE_DIR%</string>
              <key>id</key>
              <string>com.github.openfaas.faas-cli</string>
              <key>options</key>
              <string>purge_ds_store</string>
              <key>chown</key>
              <array>
                <dict>
                  <key>path</key>
                  <string>usr</string>
                  <key>user</key>
                  <string>root</string>
                  <key>group</key>
                  <string>admin</string>
                </dict>
                <dict>
                  <key>path</key>
                  <string>usr/local/bin/faas-cli</string>
                  <key>user</key>
                  <string>root</string>
                  <key>group</key>
                  <string>admin</string>
									<key>mode</key>
									<string>0755</string>
                </dict>
              </array>
            </dict>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>PathDeleter</string>
          <key>Comment</key>
          <string>Cleaning up</string>
          <key>Arguments</key>
          <dict>
            <key>path_list</key>
            <string>%pkgroot%</string>
          </dict>
        </dict>
    </array>
</dict>
</plist>
