<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of faas-cli, the CLI for use with OpenFaaS - a serverless functions framework for Docker and Kubernetes. The CLI can be used to build and deploy functions to OpenFaaS.</string>
	<key>Identifier</key>
	<string>com.github.apettinen.download.faas-cli</string>
	<key>Input</key>
	<dict>
		<key>GITHUB_REPO</key>
		<string>openfaas/faas-cli</string>
		<key>NAME</key>
		<string>faas-cli</string>
		<key>INCLUDE_PRERELEASES</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>include_prereleases</key>
				<string>%INCLUDE_PRERELEASES%</string>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
				<key>asset_regex</key>
				<string>faas-cli-darwin</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<!-- <key>filename</key>
				<string>%url%</string> -->
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%.sha256</string>
				<key>re_pattern</key>
				<string>(?P&lt;checksum&gt;\w+)</string>
			</dict>
		</dict> 
		<dict>
			<key>Processor</key>
			<string>io.github.hjuutilainen.SharedProcessors/ChecksumVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>algorithm</key>
				<string>SHA256</string>
				<key>checksum</key>
				<string>%checksum%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
