<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
		<string>Downloads and packages Terragrunt, a thin wrapper for Terraform that provides extra tools for working with multiple Terraform modules. Defaults to amd64 version. Installs to /usr/local/bin/terragrunt</string>
    <key>Identifier</key>
    <string>com.github.apettinen.pkg.terragrunt</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Terragrunt</string>
			<key>ARCHITECTURE</key>
			<string>darwin_amd64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apettinen.download.terragrunt</string>
    <key>Process</key>
    <array>
        <dict>
          <key>Processor</key>
          <string>PkgRootCreator</string>
          <key>Arguments</key>
          <dict>
            <key>pkgroot</key>
            <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            <key>pkgdirs</key>
            <dict>
              <key>usr</key>
              <string>0755</string>
              <key>usr/local</key>
              <string>0755</string>
              <key>usr/local/bin</key>
              <string>0755</string>
            </dict>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>Copier</string>
          <key>Comment</key>
          <string>Copy and rename the downloaded binary from the unarchived subfolder</string>
          <key>Arguments</key>
          <dict>
            <key>source_path</key>
           <!-- <string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%</string> -->
						<string>%pathname%</string>
            <key>destination_path</key>
            <string>%pkgroot%/usr/local/bin/terragrunt</string>
						<key>overwrite</key>
						<true/>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>PkgCreator</string>
          <key>Arguments</key>
          <dict>
            <key>pkgname</key>
            <string>%NAME%-%version%</string>
            <key>pkg_request</key>
            <dict>
              <key>pkgdir</key>
              <string>%RECIPE_CACHE_DIR%</string>
              <key>id</key>
              <string>io.gruntwork.terragrunt</string>
              <key>options</key>
              <string>purge_ds_store</string>
              <key>chown</key>
              <array>
                <dict>
                  <key>path</key>
                  <string>usr</string>
                  <key>user</key>
                  <string>root</string>
                  <key>group</key>
                  <string>admin</string>
                </dict>
              </array>
            </dict>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>PathDeleter</string>
          <key>Comment</key>
          <string>Cleaning up</string>
          <key>Arguments</key>
          <dict>
            <key>path_list</key>
            <string>%pkgroot%</string>
          </dict>
        </dict>
    </array>
</dict>
</plist>
