<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Terragrunt is a thin wrapper for Terraform that provides extra tools for working with multiple Terraform modules. Defaults to amd64 version.</string>
	<key>Identifier</key>
	<string>com.github.apettinen.download.terragrunt</string>
	<key>Input</key>
	<dict>
		<key>GITHUB_REPO</key>
		<string>gruntwork-io/terragrunt</string>
		<key>NAME</key>
		<string>Terragrunt</string>
		<key>INCLUDE_PRERELEASES</key>
		<string></string>
		<key>ARCHITECTURE</key>
		<string>darwin_amd64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
				<key>asset_regex</key>
				<string>terragrunt_%ARCHITECTURE%</string>
				<key>include_prereleases</key>
				<string>%INCLUDE_PRERELEASES%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
