<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads, packages and install the latest version of 1Password Command Line Interface. The package will be installed to /usr/local/bin and can be verified via e.g. gpg or keybase with the /usr/local/bin/op.sig file.</string>
    <key>Identifier</key>
    <string>com.github.apettinen.install.1Password_CLI</string>
    <key>Input</key>
    <dict/>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apettinen.pkg.1Password_CLI</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/1Password_CLI.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
