<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of 1Password Command Line Interface from AgileBits</string>
    <key>Identifier</key>
    <string>com.github.apettinen.download.1Password_CLI</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>1Password CLI</string>
        <key>ARCHITECTURE</key>
        <string>amd64</string>
        <key>URL</key>
        <string></string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
          <key>Processor</key>
          <string>URLTextSearcher</string>
          <key>Arguments</key>
          <dict>
            <key>url</key>
            <string>https://app-updates.agilebits.com/product_history/CLI</string>
            <key>re_pattern</key>
            <string>https://cache.agilebits.com/dist/1P/op/pkg/v(\d*\.\d*\.\d*)/op_darwin_%ARCHITECTURE%_v(?P&lt;version&gt;\d*\.\d*\.\d*).zip</string>
            <key>result_output_var_name</key>
            <string>version</string>
          </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://cache.agilebits.com/dist/1P/op/pkg/v%version%/op_darwin_%ARCHITECTURE%_v%version%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
