<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of 1Password Command Line Interface</string>
    <key>Identifier</key>
    <string>com.github.apettinen.download.1Password_CLI</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>1Password CLI</string>
        <key>ARCHITECTURE</key>
        <string>amd64</string>
        <key>URL</key>
        <string></string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
          <key>Processor</key>
          <string>URLTextSearcher</string>
          <key>Arguments</key>
          <dict>
            <key>url</key>
            <string>https://app-updates.agilebits.com/product_history/CLI</string>
            <key>re_pattern</key>
            <string>https://cache.agilebits.com/dist/1P/op/pkg/v[0-9,.]\..\..\/op_darwin_%ARCHITECTURE%_v[0-9,.]\..\..\.zip</string>
          </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <!-- <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict> -->
    </array>
</dict>
</plist>
