<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download Brave browser for macOS</string>
    <key>Identifier</key>
    <string>com.github.apettinen.download.brave</string>
    <key>Input</key>
    <dict>
        <key>INCLUDE_PRERELEASES</key>
        <string></string>
        <key>NAME</key>
        <string>Brave</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
              <key>include_prereleases</key>
              <string>%INCLUDE_PRERELEASES%</string>
              <key>github_repo</key>
              <string>brave/brave-browser</string>
              <key>asset_regex</key>
              <string>Brave-Browser.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
          <key>Processor</key>
          <string>CodeSignatureVerifier</string>
          <key>Arguments</key>
          <dict>
            <key>input_path</key>
            <string>%pathname%/Brave Browser.app</string>
            <key>requirement</key>
            <string>(identifier "com.brave.Browser" or identifier "com.brave.Browser.beta" or identifier "com.brave.Browser.dev" or identifier "com.brave.Browser.nightly") and (certificate leaf = H"392f0ba65b348b1fa2fa028aa11752a01b8481a5" or certificate leaf = H"392f0ba65b348b1fa2fa028aa11752a01b8481a5")</string>
          </dict>
        </dict>
    </array>
</dict>
</plist>
