<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Apple installer package for the latest release of podman and installs it, relying on gregneagle-recipes.download.podman. See that recipe for configuration options, this is just a simple install recipe.</string>
    <key>Identifier</key>
    <string>com.github.apettinen.install.podman</string>
    <key>Input</key>
    <dict/>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.gregneagle-recipes.download.podman</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
