<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest universal Podman Desktop app. Supports multiple architectures, and fileformats.</string>
    <key>Identifier</key>
    <string>com.github.apettinen.download.PodmanDesktop</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PodmanDesktop</string>
        <key>INCLUDE_PRERELEASES</key>
        <string></string>
        <!-- options for architecture: arm64, universal, x64, etc, see repo for details -->
        <key>ARCHITECTURE</key>
        <string>universal</string>
        <!-- options for FILEFORMAT: dmg, exe, and zip -->
        <key>FILEFORMAT</key>
        <string>dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
              <key>include_prereleases</key>
              <string>%INCLUDE_PRERELEASES%</string>
              <key>github_repo</key>
              <string>podman-desktop/podman-desktop</string>
              <key>asset_regex</key>
              <string>podman-desktop-(\d+).(\d+)?(.\d+)-%ARCHITECTURE%.%FILEFORMAT%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Podman Desktop.app</string>
                <key>deep_verification</key>
                <true/>
                <key>strict_verification</key>
                <true/>
                <key>requirement</key>
                <string>identifier "io.podmandesktop.PodmanDesktop" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = HYSCB8KRL2</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/Podman Desktop.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
