<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download Corectl for macOS. </string>
    <key>Identifier</key>
    <string>com.github.apettinen.munki.corectl</string>
    <key>Input</key>
    <dict>
        <key>INCLUDE_PRERELEASES</key>
        <string></string>
        <key>NAME</key>
        <string>Corectl</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
              <key>include_prereleases</key>
              <string>%INCLUDE_PRERELEASES%</string>
              <key>github_repo</key>
              <string>TheNewNormal/corectl.app</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
          <key>Processor</key>
          <string>CodeSignatureVerifier</string>
          <key>Arguments</key>
          <dict>
            <key>input_path</key>
            <string>%pathname%/corectl.app</string>
            <key>requirement</key>
            <string>anchor apple generic and identifier "linxos.net.corectl.app" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5LVLAZJPH7")</string>
          </dict>
        </dict>
    </array>
</dict>
</plist>
