<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
		<string>Downloads Vapor Toolbox, a tool that simplifies common command line tasks when using Vapor.</string>
    <key>Identifier</key>
    <string>com.github.apettinen.download.vaportoolbox</string>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>VaporToolbox</string>
        <key>INCLUDE_PRERELEASES</key>
        <string></string>
    </dict>
    <key>Process</key>
    <array>
				<dict>
					<key>Processor</key>
					<string>GitHubReleasesInfoProvider</string>
					<key>Arguments</key>
					<dict>
						<key>github_repo</key>
						<string>vapor/toolbox</string>
						<key>include_prereleases</key>
						<string>%INCLUDE_PRERELEASES%</string>
					</dict>
				</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
							<key>filename</key>
							<string>%NAME%-%version%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
