<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads, packages and imports to Munki the latest version of LuLu by Objective-See. 
        Please Note: In order to minimise user requests on first launch you'll need to 
        deploy a System Extension Profile and Content Filter profile with this title</string>
    <key>Identifier</key>
    <string>com.github.apettinen.munki.LuLu</string>
    <key>ParentRecipe</key>
    <string>com.github.apettinen.download.LuLu</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_NAME</key>
        <string>%NAME%</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>MUNKI_CATEGORY</key>
        <string>Security</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Objective-See</string>
        <key>DISPLAY_NAME</key>
        <string>LuLu Firewall</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>LuLu is the free open-source macOS firewall aiming to block outgoing connections.</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%MUNKI_NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
            <key>minimum_os_version</key>
            <string>10.15</string>
            <key>uninstall_script</key>
            <string>#!/bin/sh
/bin/echo "killing the main app"
/usr/bin/killall "LuLu" 2> /dev/null
/bin/echo "Removing the main app"
/bin/rm -rf /Applications/LuLu.app
/bin/echo "removed the main app, killing the process"
/usr/bin/killall "com.objective-see.luluHelper" 2> /dev/null
/usr/bin/killall "LuLu Helper" 2> /dev/null
/bin/echo "uninstall completed"
exit 0
            </string>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
