<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of LuLu by Objective-See. LuLu is the free open-source macOS firewall aiming to block outgoing connections. LuLu is currently in Alpha stage!</string>
    <key>Identifier</key>
    <string>com.github.apettinen.download.LuLu</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>LuLu</string>
        <key>GITHUB_REPO</key>
        <string>objective-see/LuLu</string>
        <key>INCLUDE_PRERELEASES</key>
        <string>True</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
          <key>Processor</key>
          <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
              <key>include_prereleases</key>
              <string>%INCLUDE_PRERELEASES%</string>
              <key>github_repo</key>
              <string>%GITHUB_REPO%</string>
              <key>asset_regex</key>
              <string>LuLu_[\d+?]{1,}.|_[\d+?]{1,}.|_[\d+?]{1,}.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <!-- <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%URL%</string>
            </dict> -->
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unzipped/</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>CodeSignatureVerifier</string>
          <key>Arguments</key>
          <dict>
            <key>input_path</key>
            <string>%RECIPE_CACHE_DIR%/unzipped/LuLu Installer.app</string>
            <key>requirement</key>
						<string>anchor apple generic and identifier
						"com.objective-see.lulu.installer" and (certificate
						leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate
						1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate
						leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate
						leaf[subject.OU] = VBG97UB4TA)</string>
          </dict>
        </dict>
    </array>
</dict>
</plist>
