<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and packages the latest version of LuLu by Objective-See. LuLu is the free open-source macOS firewall aiming to block outgoing connections. LuLu is currently in Alpha stage!</string>
    <key>Identifier</key>
    <string>com.github.apettinen.pkg.LuLu</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>LuLu</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apettinen.download.LuLu</string>
    <key>Process</key>
    <array>
        <dict>
          <key>Processor</key>
          <string>PkgRootCreator</string>
          <key>Arguments</key>
          <dict>
            <key>pkgroot</key>
            <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            <key>pkgdirs</key>
            <dict>
              <key>Library</key>
              <string>0755</string>
              <key>Library/Objective-See</key>
              <string>0755</string>
              <key>Library/Extensions</key>
              <string>0755</string>
              <key>Library/Objective-See/LuLu</key>
              <string>0755</string>
            </dict>
          </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%pkgroot%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>PkgCreator</string>
          <key>Arguments</key>
          <dict>
            <key>pkgname</key>
            <string>%NAME%</string>
            <key>pkg_request</key>
            <dict>
              <key>pkgdir</key>
              <string>%RECIPE_CACHE_DIR%</string>
              <key>id</key>
              <string>com.objective-see.LuLu</string>
              <key>options</key>
              <string>purge_ds_store</string>
              <key>version</key>
              <string>Alpha</string>
              <key>chown</key>
              <array>
                <dict>
                  <key>path</key>
                  <string>usr</string>
                  <key>user</key>
                  <string>root</string>
                  <key>group</key>
                  <string>admin</string>
                </dict>
              </array>
            </dict>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>PathDeleter</string>
          <key>Comment</key>
          <string>Cleaning up</string>
          <key>Arguments</key>
          <dict>
            <key>path_list</key>
            <string>%pkgroot%</string>
          </dict>
        </dict>
    </array>
</dict>
</plist>
