<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and packages the latest version of LuLu by Objective-See. LuLu is the free open-source macOS firewall aiming to block outgoing connections. LuLu is currently in Alpha stage!</string>
    <key>Identifier</key>
    <string>com.github.apettinen.pkg.LuLu</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>LuLu</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apettinen.download.LuLu</string>
    <key>Process</key>
    <array>
        <dict>
          <key>Processor</key>
          <string>PkgRootCreator</string>
          <key>Arguments</key>
          <dict>
            <key>pkgroot</key>
            <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            <key>pkgdirs</key>
            <dict>
              <key>Library</key>
              <string>0755</string>
              <key>Library/Objective-See</key>
              <string>0755</string>
              <key>Library/Extensions</key>
              <string>0755</string>
              <key>Library/LaunchDaemons</key>
              <string>0755</string>
              <key>Library/Objective-See/LuLu</key>
              <string>0755</string>
              <key>Applications</key>
              <string>0755</string>
            </dict>
          </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unzipped/</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>CodeSignatureVerifier</string>
          <key>Arguments</key>
          <dict>
            <key>input_path</key>
            <string>%RECIPE_CACHE_DIR%/unzipped/LuLu.app</string>
            <key>requirements</key>
            <string>anchor apple generic and identifier "com.objective-see.lulu" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VBG97UB4TA)</string>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>Versioner</string>
          <key>Arguments</key>
          <dict>
            <key>input_plist_path</key>
            <string>%RECIPE_CACHE_DIR%/unzipped/LuLu.app/Contents/Info.plist</string>
            <key>plist_version_key</key>
            <string>CFBundleShortVersionString</string>
          </dict>
        </dict>
        <!-- Move files and directories -->
        <dict>
          <key>Processor</key>
          <string>FileMover</string>
          <key>Arguments</key>
          <dict>
            <key>source</key>
            <string>%RECIPE_CACHE_DIR%/unzipped/rules.plist</string>
            <key>target</key>
            <string>%pkgroot%/Library/Objective-See/LuLu/rules.plist</string>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>FileMover</string>
          <key>Arguments</key>
          <dict>
            <key>source</key>
            <string>%RECIPE_CACHE_DIR%/unzipped/LuLuDaemon</string>
            <key>target</key>
            <string>%pkgroot%/Library/Objective-See/LuLu/LuLuDaemon</string>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>FileMover</string>
          <key>Arguments</key>
          <dict>
            <key>source</key>
            <string>%RECIPE_CACHE_DIR%/unzipped/com.objective-see.lulu.plist</string>
            <key>target</key>
            <string>%pkgroot%/Library/LaunchDaemons/com.objective-see.lulu.plist</string>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>Copier</string>
          <key>comment</key>
          <string>Copy directories from .zip to correct paths inside the pkg</string>
          <key>Arguments</key>
          <dict>
            <key>source_path</key>
            <string>%RECIPE_CACHE_DIR%/unzipped/LuLu.kext</string>
            <key>destination_path</key>
            <string>%pkgroot%/Library/Extensions/LuLu.kext</string>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>Copier</string>
          <key>Arguments</key>
          <dict>
            <key>source_path</key>
            <string>%RECIPE_CACHE_DIR%/unzipped/LuLu.app</string>
            <key>destination_path</key>
            <string>%pkgroot%/Applications/LuLu.app</string>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>PkgCreator</string>
          <key>Arguments</key>
          <dict>
            <key>pkgname</key>
            <string>%NAME%</string>
            <key>pkg_request</key>
            <dict>
              <key>pkgdir</key>
              <string>%RECIPE_CACHE_DIR%</string>
              <key>id</key>
              <string>com.objective-see.LuLu</string>
              <key>options</key>
              <string>purge_ds_store</string>
              <key>version</key>
              <string>%version%</string>
              <key>pkgtype</key>
              <string>flat</string>
              <key>chown</key>
              <array>
                <dict>
                  <!-- rules -->
                  <key>path</key>
                  <string>/Library/Objective-See/LuLu/rules.plist</string>
                  <key>user</key>
                  <string>root</string>
                  <key>group</key>
                  <string>wheel</string>
                  <key>mode</key>
                  <string>0700</string>
                </dict>
                <dict>
                  <!-- kext -->
                  <key>path</key>
                  <string>/Library/Extensions/LuLu.kext</string>
                  <key>user</key>
                  <string>root</string>
                  <key>group</key>
                  <string>wheel</string>
                </dict>
                <dict>
                  <!-- launch daemon -->
                  <key>path</key>
                  <string>/Library/Objective-See/LuLu/LuLuDaemon</string>
                  <key>user</key>
                  <string>root</string>
                  <key>group</key>
                  <string>wheel</string>
                  <key>mode</key>
                  <string>0755</string>
                </dict>
                <dict>
                  <!-- launch daemon plist -->
                  <key>path</key>
                  <string>/Library/LaunchDaemons/com.objective-see.lulu.plist</string>
                  <key>user</key>
                  <string>root</string>
                  <key>group</key>
                  <string>wheel</string>
                  <key>mode</key>
                  <string>0644</string>
                </dict>
                <dict>
                  <key>path</key>
                  <string>/Applications</string>
                  <key>user</key>
                  <string>root</string>
                  <key>group</key>
                  <string>admin</string>
                </dict>
                <dict>
                  <!-- main application -->
                  <key>path</key>
                  <string>/Applications/LuLu.app</string>
                  <key>user</key>
                  <string>root</string>
                  <key>group</key>
                  <string>wheel</string>
                </dict>
              </array>
              <key>scripts</key>
              <string>%pkgroot%/scripts</string>
            </dict>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>PathDeleter</string>
          <key>Comment</key>
          <string>Cleaning up</string>
          <key>Arguments</key>
          <dict>
            <key>path_list</key>
            <array>
              <string>%pkgroot%</string>
              <string>%RECIPE_CACHE_DIR%/unzipped</string>
            </array>
          </dict>
        </dict>
    </array>
</dict>
</plist>
