<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and packages the latest version of LuLu by Objective-See. 
        Please Note: In order to minimise user requests on first launch you'll need to 
        deploy a System Extension Profile and Content Filter profile with this title</string>
    <key>Identifier</key>
    <string>com.github.apettinen.pkg.LuLu</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>LuLu</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apettinen.download.LuLu</string>
    <key>Process</key>
    <array>
        <dict>
          <key>Processor</key>
          <string>PkgRootCreator</string>
          <key>Arguments</key>
          <dict>
            <key>pkgroot</key>
            <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            <key>pkgdirs</key>
            <dict>
              <key>build</key>
              <string>0755</string>
              <key>build/Applications</key>
              <string>0755</string>
            </dict>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>Versioner</string>
          <key>Arguments</key>
          <dict>
            <key>input_plist_path</key>
            <string>%pathname%/LuLu.app/Contents/Info.plist</string>
            <key>plist_version_key</key>
            <string>CFBundleShortVersionString</string>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>Copier</string>
          <key>Arguments</key>
          <dict>
            <key>source_path</key>
            <string>%pathname%/LuLu.app</string>
            <key>destination_path</key>
            <string>%pkgroot%/build/Applications/LuLu.app</string>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>PkgCreator</string>
          <key>Arguments</key>
          <dict>
            <key>pkg_request</key>
            <dict>
              <key>pkgname</key>
              <string>%NAME%-%version%</string>
              <key>pkgroot</key>
              <string>%pkgroot%/build</string>
              <key>pkgdir</key>
              <string>%RECIPE_CACHE_DIR%</string>
              <key>id</key>
              <string>com.objective-see.LuLu</string>
              <key>options</key>
              <string>purge_ds_store</string>
              <key>version</key>
              <string>%version%</string>
              <key>pkgtype</key>
              <string>flat</string>
              <key>chown</key>
              <array>
                <dict>
                  <!-- Applications dir -->
                  <key>path</key>
                  <string>/Applications</string>
                  <key>user</key>
                  <string>root</string>
                  <key>group</key>
                  <string>admin</string>
                </dict>
                <dict>
                  <!-- main application -->
                  <key>path</key>
                  <string>/Applications/LuLu.app</string>
                  <key>user</key>
                  <string>root</string>
                  <key>group</key>
                  <string>wheel</string>
                </dict>
              </array>
            </dict>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>PathDeleter</string>
          <key>Comment</key>
          <string>Cleaning up</string>
          <key>Arguments</key>
          <dict>
            <key>path_list</key>
            <array>
              <string>%pkgroot%</string>
            </array>
          </dict>
        </dict>
    </array>
</dict>
</plist>
